---
kind: other
id: Properties.T:Autodesk.Revit.DB.BuiltInFailures.AssemblyFailures
source: html/0de6e118-eecc-7aa2-f37e-6c97cb05154d.htm
---
# BuiltInFailures.AssemblyFailures Properties

Selected Element(s) cannot be added to the assembly. Elements must have the same phases as the assembly to be included in the assembly.